
const dictionary =
[
  //............................................................................
  // [symbol, name]

  [`e`, `héf e`],
  [`é`, `héf é`],
  [`i`, `héf i`],
  [`a`, `héf a`],
  [`á`, `héf á`],
  [`o`, `héf o`],
  [`ó`, `héf ó`],
  [`u`, `héf u`],

  [`I`, `ból i`],
  [`E`, `ból e`],
  [`É`, `ból é`],
  [`A`, `ból a`],
  [`Á`, `ból á`],
  [`O`, `ból o`],
  [`Ó`, `ból ó`],
  [`U`, `ból u`],

  [`f`, `fe`],
  [`v`, `vé`],
  [`s`, `sa`],
  [`z`, `zá`],
  [`x`, `xo`],
  [`j`, `jó`],

  [`b`, `be`],
  [`p`, `pé`],
  [`d`, `da`],
  [`t`, `tá`],
  [`g`, `go`],
  [`k`, `kó`],

  [`h`, `he`],
  [`y`, `yé`],
  [`l`, `la`],
  [`r`, `rá`],
  [`n`, `no`],
  [`m`, `mó`],

  [`0`, `fil`], // 0
  [`1`, `ver`], // 1
  [`2`, `séy`], // 2
  [`3`, `zah`], // 3
  [`4`, `xák`], // 4
  [`5`, `jog`], // 5
  [`6`, `bót`], // 6
  [`7`, `pud`], // 7
  [`8`, `dip`], // 8
  [`!`, `teb`], // 9
  [`@`, `géj`], // 10
  [`#`, `kax`], // 11
  [`$`, `ház`], // 12
  [`%`, `yos`], // 13
  [`^`, `lóv`], // 14
  [`&`, `ruf`], // 15

  [`?`, ``],
  [`,`, ``],
  [`.`, ``],

  [`'`, ``],
  [`"`, ``],
  ["`", ``],
  [`~`, ``],

  [`(`, ``],
  [`)`, ``],
  [`[`, ``],
  [`]`, ``],
  [`{`, ``],
  [`}`, ``],

  [`<`, ``],
  [`>`, ``],

  [`=`, ``],
  [`:`, ``],

  [`-`, `un`],
  [`+`, `ni`],
  [`/`, `unU`],
  [`*`, `Ini`],
  [`--`, `Unun`],
  [`++`, `ninI`],

  //............................................................................
  // [nuhAlin, English]

  [`féb`, `symbol`],
  [`sád`, `word`],
  [`xóg`, `phrase`],

  [``, `less than`],
  [``, `more than`],

  [``, `equal`],
  [``, `different`],

  [`u`, `no`],
  [`o`, `or`],
  [`e`, `maybe`],
  [`i`, `yes`],

  [`un`, `addition or and`],
  [`ni`, `subtraction`],
  [`unU`, `division`],
  [`Ini`, `multiplication`],
  [`Unun`, `root`],
  [`ninI`, `potence`],

  [`brokt`, `constant`],
  [`djeyf`, `relative`],

  [``, `thought`],
  [``, `action`],

  //............................................................................

  [`yir`, `I`],
  [`hel`, `person (not limited to humans)`],
  [`roy`, `object (everything which is not a person)`],
  [`luh`, `you`],

  [`Ijna hel`, `this person`],
  [`ankU hel`, `that person`],

  [`Ijna luh`, `this object`],
  [`ankU luh`, `that object`],

  //............................................................................

  [`ikÁju`, `size`],
  [`héf`, `small`],
  [`ból`, `big`],

  [`emzÁtmo`, `distance`],
  [`Ijna`, `near (héf)`],
  [`ankU`, `far (ból)`],

  //............................................................................
]

